blocks = ( 

    ((0,1), (0,2), (0,3)),
    ((1,0), (2,0), (3,0)),
    ((1,0), (1,1), (1,2)),
    ((0,1), (1,0), (2,0)),
    ((0,1), (0,2), (1,2)),
    ((1,0), (2,0), (2,-1)),
    ((0,1), (0,2), (-1,2)),
    ((1,0), (2,0), (2,1)),
    ((0,1), (0,2), (1,0)),
    ((0,1), (1,1), (2,1)),
    ((0,1), (1,0), (1,1)),
    ((0,1), (-1,1), (-1,2)),
    ((1,0), (1,1), (2,1)),
    ((0,1), (1,1), (1,2)),
    ((1,0), (1,-1), (2,-1)),
    ((0,1), (0,2), (-1,1)),
    ((0,1), (0,2), (1,1)),
    ((1,0), (2,0), (1,1)),
    ((1,0), (2,0), (1,-1)),
          
    )

n,m = map(int, input().split())


a = [list(map(int, input().split())) for _ in range(n)]  # n개만큼의 row를 갖는 배열을 갖되, 컬럼의 개수는 input 에 따라 달라진다. 

ans = 0

for i in range(n) :
    for j in range(m) :
        for block in blocks:
            ok = True
            s = a[i][j]
            for dx, dy in block: # blocks 안의 block에 대해 본다. block안을 또 살펴서 dx, dy를 찾는다. 
                x,y = i+dx, j+dy
                if 0 <= x < n and 0 <= y < m :
                    s += a[x][y]
                    
                else :
                    ok = False
                    break
            if ok and ans < s :
                ans = s + a

print(ans) 


## solved.ac 에서 런타임 에러 발생